# ViewExportedEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewExportedEventArgs Class
Members See Also
---
The event arguments used by the ViewExported event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class ViewExportedEventArgs : RevitAPIPostDocEventArgs
```

Visual Basic
---
```text
Public Class ViewExportedEventArgs _
	Inherits RevitAPIPostDocEventArgs
```

Visual C++
---
```text
public ref class ViewExportedEventArgs : public RevitAPIPostDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..ViewExportedEventArgs
# See Also
ViewExportedEventArgs Members
Autodesk.Revit.DB.Events Namespace